"%[All]@ of the following are true" = "满足以下%1$[全部]@条件";
"%[Any]@ of the following are true" = "满足以下%1$[任一]@条件";
"%[None]@ of the following are true" = "满足以下%1$[无]@条件";

"%[displayName]@ %[is]@ %@" = "%1$[名称]@ %2$[是]@ %3$@";
"%[displayName]@ %[is not]@ %@" = "%1$[名称]@ %2$[不是]@ %3$@";
"%[displayName]@ %[begins with]@ %@" = "%1$[名称]@ %2$[开头是]@ %3$@";
"%[displayName]@ %[ends with]@ %@" = "%1$[名称]@ %2$[结尾是]@ %3$@";
"%[displayName]@ %[contains]@ %@" = "%1$[名称]@ %2$[包含]@ %3$@";
"%[displayName]@ %[matches]@ %@" = "%1$[名称]@ %2$[匹配]@ %3$@";

"%[path]@ %[is]@ %@" = "%1$[路径]@ %2$[是]@ %3$@";
"%[path]@ %[is not]@ %@" = "%1$[路径]@ %2$[不是]@ %3$@";
"%[path]@ %[begins with]@ %@" = "%1$[路径]@ %2$[开头是]@ %3$@";
"%[path]@ %[ends with]@ %@" = "%1$[路径]@ %2$[结尾是]@ %3$@";
"%[path]@ %[contains]@ %@" = "%1$[路径]@ %2$[包含]@ %3$@";
"%[path]@ %[matches]@ %@" = "%1$[路径]@ %2$[匹配]@ %3$@";

"%[modificationDate]@ %[is greater than]@ %@ %[days]@" = "%1$[修改日期]@ %2$[在过去]@ %3$@ %4$[天]@";
"%[modificationDate]@ %[is greater than]@ %@ %[weeks]@" = "%1$[修改日期]@ %2$[在过去]@ %3$@ %4$[周]@";
"%[modificationDate]@ %[is greater than]@ %@ %[months]@" = "%1$[修改日期]@ %2$[在过去]@ %3$@ %4$[个月]@";
"%[modificationDate]@ %[is less than]@ %@ %[days]@" = "%1$[修改日期]@ %2$[不在过去]@ %3$@ %4$[天]@";
"%[modificationDate]@ %[is less than]@ %@ %[weeks]@" = "%1$[修改日期]@ %2$[不在过去]@ %3$@ %4$[周]@";
"%[modificationDate]@ %[is less than]@ %@ %[months]@" = "%1$[修改日期]@ %2$[不在过去]@ %3$@ %4$[个月]@";

"%[modificationDate]@ %[is]@ %@" = "%1$[修改日期]@ %2$[是]@ %3$@";
"%[modificationDate]@ %[is not]@ %@" = "%1$[修改日期]@ %2$[不是]@ %3$@";
"%[modificationDate]@ %[is less than]@ %@" = "%1$[修改日期]@ %2$[早于]@ %3$@";
"%[modificationDate]@ %[is greater than]@ %@" = "%1$[修改日期]@ %2$[晚于]@ %3$@";

"%[size]@ %[is]@ %@ %[KB]@" = "%1$[大小]@ %2$[等于]@ %3$@ %4$[KB]@";
"%[size]@ %[is]@ %@ %[MB]@" = "%1$[大小]@ %2$[等于]@ %3$@ %4$[MB]@";
"%[size]@ %[is]@ %@ %[GB]@" = "%1$[大小]@ %2$[等于]@ %3$@ %4$[GB]@";
"%[size]@ %[is greater than]@ %@ %[KB]@" = "%1$[大小]@ %2$[大于]@ %3$@ %4$[KB]@";
"%[size]@ %[is greater than]@ %@ %[MB]@" = "%1$[大小]@ %2$[大于]@ %3$@ %4$[MB]@";
"%[size]@ %[is greater than]@ %@ %[GB]@" = "%1$[大小]@ %2$[大于]@ %3$@ %4$[GB]@";
"%[size]@ %[is less than]@ %@ %[KB]@" = "%1$[大小]@ %2$[小于]@ %3$@ %4$[KB]@";
"%[size]@ %[is less than]@ %@ %[MB]@" = "%1$[大小]@ %2$[小于]@ %3$@ %4$[MB]@";
"%[size]@ %[is less than]@ %@ %[GB]@" = "%1$[大小]@ %2$[小于]@ %3$@ %4$[GB]@";
"%[size]@ %[is not]@ %@ %[KB]@" = "%1$[大小]@ %2$[不是]@ %3$@ %4$[KB]@";
"%[size]@ %[is not]@ %@ %[MB]@" = "%1$[大小]@ %2$[不是]@ %3$@ %4$[MB]@";
"%[size]@ %[is not]@ %@ %[GB]@" = "%1$[大小]@ %2$[不是]@ %3$@ %4$[GB]@";

"%[kind]@ %[is]@ %@" = "%1$[种类]@ %2$[是]@ %3$@";
"%[kind]@ %[is not]@ %@" = "%1$[种类]@ %2$[不是]@ %3$@";
"%[kind]@ %[contains]@ %@" = "%1$[种类]@ %2$[包含]@ %3$@";
"%[kind]@ %[matches]@ %@" = "%1$[种类]@ %2$[匹配]@ %3$@";


